src/DataProcessors/InteractiveDataExchangeWizardSaaS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<DataProcessor>
		<Properties>
			<Name>InteractiveDataExchangeWizardSaaS</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>InfobaseNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/SystemMessageExchangeSessions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>SystemMessageExchangeSessions</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>StartDate</Name>
					<Comment>Session begin date.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CompletedSuccessfully</Name>
					<Comment>Flag of successful session completion</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CompletedWithError</Name>
					<Comment>Flag of unsuccessful session completion</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Data</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Session</Name>
					<Comment>Session UUID</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/InteractiveDataExchangeWizardSaaS/Ext/ManagerModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

#Region InternalInterface

// The procedure is used as the background job handler, which performs
// additional data registration and exchange.
//
// Parameters:
//         ExportDataProcessor - DataProcessorObject.InteractiveExportModification - initialized object.
//         StorageAddress      - String, UUID - Storage address, used to get the procedure result.
// 
Procedure ExchangeOnDemand(Val ExportDataProcessor, Val StorageAddress = Undefined) Export
	
	RecordExportAdditionData(ExportDataProcessor);
	
	Session = StartExchangeOnDemand(ExportDataProcessor.InfobaseNode);
	
	If StorageAddress <> Undefined Then
		PutToTempStorage(New Structure("Session", Session), StorageAddress);
	EndIf;
	
EndProcedure

// Registers additional data according to the settings.
//
// Parameters:
//         ExportDataProcessor - Structure, DataProcessorObject.InteractiveExportModification - initialized object.
//
Procedure RecordExportAdditionData(Val ExportDataProcessor)
	
	If TypeOf(ExportDataProcessor) = Type("Structure") Then
		DataProcessor = DataProcessors.InteractiveExportModification.Create();
		FillPropertyValues(DataProcessor, ExportDataProcessor, , "AdditionalRegistration, AdditionalNodeScenarioRegistration");
		DataExchangeServer.FillValueTable(DataProcessor.AdditionalRegistration, ExportDataProcessor.AdditionalRegistration);
		DataExchangeServer.FillValueTable(DataProcessor.AdditionalNodeScenarioRegistration, ExportDataProcessor.AdditionalNodeScenarioRegistration);
	Else
		DataProcessor = ExportDataProcessor;
	EndIf;
	
	If DataProcessor.ExportVariant <= 0 Then
		// No adding
		Return;
		
	ElsIf DataProcessor.ExportVariant = 1 Then
		// Period with filter, clearing additional registration
		DataProcessor.AdditionalRegistration.Clear();
		
	ElsIf DataProcessor.ExportVariant = 2 Then
		// Detailed settings, clearing general parameters
		DataProcessor.AllDocumentsFilterComposer = Undefined;
		DataProcessor.AllDocumentsFilterPeriod   = Undefined;
		
	EndIf;
	
	DataProcessor.RecordAdditionalChanges();
EndProcedure

// Starts exchange on demand.
//
// Parameters:
//         InfobaseNode - ExchangePlanRef - Reference to correspondent.
//
Function StartExchangeOnDemand(Val InfobaseNode) Export
	
	SetPrivilegedMode(True);
	
	BeginTransaction();
	Try
		Message = MessagesSaaS.NewMessage(
			MessagesDataExchangeAdministrationManagementInterface.PushSynchronizationMessage()
		);
		
		Session = InformationRegisters.SystemMessageExchangeSessions.NewSession();
		
		Message.Body.Zone      = CommonUse.SessionSeparatorValue();
		Message.Body.SessionId = Session;
		
		MessagesSaaS.SendMessage(Message, SaaSOperationsCached.ServiceManagerEndpoint(), True);
		CommitTransaction();
	Except
		RollbackTransaction();
		
		WriteLogEvent(DataExchangeSaaS.DataSyncronizationLogEvent(),,,,
			DetailErrorDescription(ErrorInfo()) 
		);
			
		Session = Undefined;
	EndTry;
	
	If Session<>Undefined Then
		MessagesSaaS.DeliverQuickMessages();
	EndIf;
	
	Return Session;
EndFunction

#EndRegion

#EndIf
